Tekla.Structures.ModelInternal.GeometryExporter
GeometryExporter class provides tools to export/import part geometry.

Tekla.Structures.ModelInternal.GeometryExporter.ImportGeometry(Tekla.Structures.ModelInternal.GeometryTree@)
Imports the geometry from core

Tekla.Structures.ModelInternal.GeometryExporter.ExportGeometry(Tekla.Structures.ModelInternal.GeometryTree)
Export the geometry to core
geometry: The geometry to export.

Tekla.Structures.ModelInternal.GeometryExporter.AddNodeToList(Tekla.Structures.ModelInternal.GeometryNode,System.Int32,System.Collections.Generic.IList{System.Collections.Generic.KeyValuePair{Tekla.Structures.ModelInternal.GeometryNode,System.Int32}})
Adds the node to the list and creates children relations.
node: The node to add.
parent: The node parent node number.
list: The list.
Returns: The geometry section node.

Tekla.Structures.ModelInternal.GeometryExporter.ImportFlatGeometry(Tekla.Structures.ModelInternal.PointList,System.Int32,System.Int32)
Imports the flat geometry section.
pointList: The points list.
pointsCount: The points number to retrive.
pointIndex: The index of the first processed point.
Returns: The geometry section node.

Tekla.Structures.ModelInternal.GeometryExporter.ImportCylindricalSurfaceGeometry(Tekla.Structures.ModelInternal.PointList,System.Int32,System.Int32,System.Int32)
Imports the cylindrical surface geometry section.
pointList: The points list.
pointsCount1: Number of points in the first lateral boundary.
pointsCount2: Number of points in the second lateral boundary.
pointIndex: The index of the first processed point.
Returns: The geometry section node.

Tekla.Structures.ModelInternal.GeometryExporter.ConvertPolygonGeometryToArrays(Tekla.Structures.ModelInternal.PolygonNode,System.Int32,Tekla.Structures.ModelInternal.PointList,Tekla.Structures.ModelInternal.IntList)
Converts the polygon geometry to arrays
node: The polygon geometry node.
parentNodeNumber: The number of the polygon node parent.
pointList: The resulted point list with geometry data.
intList: The resulted integers list with geometry data.

Tekla.Structures.ModelInternal.GeometryExporter.ConvertCurvedGeometryToArrays(Tekla.Structures.ModelInternal.CylindricalSurfaceNode,System.Int32,Tekla.Structures.ModelInternal.PointList,Tekla.Structures.ModelInternal.IntList)
Converts the cylindrical surface geometry to arrays
node: The cylindrical surface geometry node.
parentNodeNumber: The number of the cylindrical surface node parent.
pointList: The resulted point list with geometry data.
intList: The resulted integers list with geometry data.

Tekla.Structures.ModelInternal.GeometryExporter.ExportGeometryToArrays(Tekla.Structures.ModelInternal.GeometryTree,Tekla.Structures.ModelInternal.PointList,Tekla.Structures.ModelInternal.IntList)
Export the geometry to arrays for transferring
geometry: The geometry to export.
pointList: The resulted point list with geometry data.
intList: The resulted integers list with geometry data.